{
  "backend/main.mo": "Main ICP actor implementing a personal finance app with user profiles, transactions, spending limits, challenges, referrals, leaderboard, and PIN verification, using access control and blob storage mixins.",
  "backend/migration.mo": "Trivial migration module that passes old actor state through unchanged, used for actor syntax migration with no actual state transformation.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (promotional carousel, PIN balance check, spending limits summary, etc.) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON index of all frontend source files with one-line descriptions of each component, page, hook, and utility in the project.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom property design tokens for light and dark themes including colors, borders, charts, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point for the FinMate React app, mounting the app into a root div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root React app configuring TanStack Router with all page routes, QueryClient, ThemeProvider, inactivity timer, and profile setup modal gating.",
  "frontend/src/components/AnalyticsChatbot.tsx": "Analytics AI chatbot card component that accepts transactions and spending limits, maintaining chat message state and generating responses via generateAnalyticsInsight.",
  "frontend/src/components/BalanceRevealCard.tsx": "Gradient card component that fetches and displays the user's bank balance with a dismiss button, shown after successful PIN verification.",
  "frontend/src/components/BankBalanceCard.tsx": "Displays the user's available bank balance in a styled card with a toggle to show/hide the balance value, using the useBalance hook and a skeleton loader while fetching.",
  "frontend/src/components/BottomNavigation.tsx": "Renders a fixed bottom navigation bar with five route links (Home, History, Analytics, Challenges, Profile), highlighting the active route using TanStack Router.",
  "frontend/src/components/CategorySpendingChart.tsx": "Renders a Recharts pie chart visualizing spending amounts broken down by category, with a fallback message when no data is available.",
  "frontend/src/components/ChallengesLeaderboardPreview.tsx": "Shows a preview card combining up to two active challenges (with a complete button) and the top-3 leaderboard entries, with skeleton loading states and links to full pages.",
  "frontend/src/components/ChatInterface.tsx": "Provides a scrollable chat UI that displays user and bot messages and includes a text input form for sending new messages.",
  "frontend/src/components/FinancialHealthScore.tsx": "Displays a radial bar chart alongside a label and score representing the user's financial health, calculated from transactions, balance, spending limits, and challenges.",
  "frontend/src/components/InactivityWarningModal.tsx": "Shows a modal dialog warning the user of an impending session timeout due to inactivity, displaying a countdown and a button to stay logged in.",
  "frontend/src/components/IncomeExpenseChart.tsx": "Renders a Recharts bar chart comparing total income versus total expenses for a given period.",
  "frontend/src/components/InsightCards.tsx": "Generates and displays a grid of AI-driven insight cards (warning, success, or info) derived from transactions and spending limits using the analyticsInsights utility.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout with a sticky gradient header containing the FinMate logo, a centered content area rendering child routes via Outlet, and the BottomNavigation component.",
  "frontend/src/components/LinkedBankAccount.tsx": "Displays the user's linked bank account (masked number) in a card and provides a button to navigate to the bank-linking page to manage or add an account.",
  "frontend/src/components/NotificationSettings.tsx": "Renders a settings card with toggles for four notification preference types, persisting changes via the useSaveNotificationPreferences hook.",
  "frontend/src/components/PaymentForm.tsx": "A form component for submitting debit or credit transactions, allowing users to enter amount, category, and description with payment method support.",
  "frontend/src/components/PinVerificationModal.tsx": "A modal dialog for PIN setup and verification, supporting 6-digit PIN entry with lockout logic after failed attempts.",
  "frontend/src/components/ProfileHeader.tsx": "Displays the user's avatar (with initials and color based on name), name, and an editable phone number field stored in localStorage.",
  "frontend/src/components/ProfileSetupModal.tsx": "A one-time setup modal that prompts new users to enter their name and initializes their profile via the save profile hook.",
  "frontend/src/components/PromotionalAdsCarousel.tsx": "An auto-advancing carousel displaying five promotional ad cards (budgeting, loans, investments, credit score, student savings) with manual navigation controls.",
  "frontend/src/components/QRScannerButton.tsx": "A circular button that opens the QRScannerModal or delegates to a custom onClick handler when provided.",
  "frontend/src/components/QRScannerModal.tsx": "A modal with tabs for QR scan (placeholder UI) and phone number payment, both rendering the PaymentForm component.",
  "frontend/src/components/QuickActions.tsx": "Renders a three-button grid for quick actions: Recharge (navigates to /recharge), Train Tickets (shows coming-soon toast), and Send Money (calls a callback).",
  "frontend/src/components/SpendingLimitsSummary.tsx": "Displays a summary card of up to 4 spending limits with progress bars, warning/over-limit indicators, and links to the spending limits page. Shows skeletons while loading and an empty state if no limits are set.",
  "frontend/src/components/SubscriptionPlan.tsx": "Renders a card showing the user's current subscription plan (Free tier) with a Crown icon and an Upgrade button that triggers a coming-soon toast.",
  "frontend/src/components/ThemeToggle.tsx": "A button component that toggles between light and dark themes using the useTheme hook, displaying a Sun or Moon icon accordingly.",
  "frontend/src/components/TopBar.tsx": "A top navigation bar showing a time-based greeting with the user's name/initials, a notification bell with badge count, and a theme toggle button.",
  "frontend/src/components/TransactionList.tsx": "Renders a list of transactions with category icons, timestamps, and amounts; optionally allows inline category editing via a dropdown menu using the useUpdateTransactionCategory hook.",
  "frontend/src/components/WeeklyComparisonChart.tsx": "Displays a grouped bar chart comparing debit spending by category between the current week and the previous week using Recharts.",
  "frontend/src/data/categories.ts": "Exports a readonly array of transaction category strings and a corresponding TypeScript type.",
  "frontend/src/data/offers.ts": "Exports a static array of promotional offer objects with discount codes, categories, and expiry dates.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAddTransaction.ts": "Provides a mutation hook to add a transaction via the backend actor, invalidating transactions and balance queries on success.",
  "frontend/src/hooks/useBalance.ts": "Fetches the caller's account balance from the backend actor using React Query.",
  "frontend/src/hooks/useChallenges.ts": "Fetches the list of challenges from the backend actor using React Query.",
  "frontend/src/hooks/useCompleteChallenge.ts": "Provides a mutation hook to mark a challenge as complete, showing a success toast and invalidating challenges and user profile queries.",
  "frontend/src/hooks/useGetBankAccount.ts": "Fetches the caller's linked bank account string from the backend actor using React Query.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Fetches the authenticated caller's user profile from the backend actor, merging actor-fetching state into the loading flag.",
  "frontend/src/hooks/useInactivityTimer.ts": "Tracks user inactivity and automatically logs out after 5 minutes of no activity, showing a warning in the final 60 seconds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useLeaderboard.ts": "React Query hook that fetches the leaderboard entries from the backend actor.",
  "frontend/src/hooks/usePinVerification.ts": "Hook managing PIN verification and setup with SHA-256 hashing, rate-limiting via attempt tracking, and a lockout countdown timer.",
  "frontend/src/hooks/useQueries.ts": "Intentionally empty placeholder file indicating queries are split into individual hook files.",
  "frontend/src/hooks/useReferrals.ts": "React Query hook that fetches the list of referral Principals from the backend actor.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "Mutation hook that saves a user profile to the backend and invalidates the currentUserProfile query on success.",
  "frontend/src/hooks/useSaveNotificationPreferences.ts": "Mutation hook that persists notification preferences to localStorage (as a backend workaround) and exposes a helper to retrieve stored preferences.",
  "frontend/src/hooks/useSetBankAccount.ts": "Mutation hook that sets a bank account number via the backend actor and invalidates related queries on success.",
  "frontend/src/hooks/useSetSpendingLimit.ts": "Mutation hook that sets a spending limit for a given category via the backend actor and invalidates spending limit queries.",
  "frontend/src/hooks/useSpendingLimits.ts": "React Query hook that fetches the list of spending limits from the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Hook that manages light/dark theme state, persists it to localStorage, and applies the appropriate CSS class to the document root.",
  "frontend/src/hooks/useTransactions.ts": "React Query hook that fetches transactions from the backend actor, optionally filtered by category.",
  "frontend/src/hooks/useUpdateTransactionCategory.ts": "Mutation hook that overrides a transaction's category by storing the mapping in localStorage as a workaround for missing backend support.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/components/utilities, CSS custom properties for light and dark themes using OKLCH colors, and utility animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AnalyticsPage.tsx": "Analytics page component displaying financial health score, income/expense and category spending charts, weekly comparisons, AI insights, and a chatbot, all filtered by a selectable time period.",
  "frontend/src/pages/BankLinkingPage.tsx": "Page for linking or updating a bank account, displaying the currently linked account (masked) and a form to submit a new account number using the useSetBankAccount hook.",
  "frontend/src/pages/ChallengesPage.tsx": "Page showing active financial challenges with progress and a complete button, the user's digi points balance, and a top-10 leaderboard.",
  "frontend/src/pages/ChatbotPage.tsx": "Page hosting a rule-based AI chatbot interface that responds to user messages with budgeting advice via the getBudgetingResponse utility.",
  "frontend/src/pages/HistoryPage.tsx": "Transaction history page with period (weekly/monthly/yearly), category, and text search filters, plus a CSV export button.",
  "frontend/src/pages/HomePage.tsx": "Main dashboard page showing a promotional carousel, PIN-gated balance reveal, QR scanner, quick actions, spending limits summary, challenges preview, and recent transactions.",
  "frontend/src/pages/LoginPage.tsx": "Login page with an animated FinMate logo and a single Internet Identity authentication button, showing a loading state during login.",
  "frontend/src/pages/OffersPage.tsx": "Page displaying active student discount offers filtered by expiry date, each showing discount percentage, description, category badge, expiry, and promo code.",
  "frontend/src/pages/ProfilePage.tsx": "Renders the user profile page with sections for profile header, linked bank account, subscription plan, notification settings, and menu items (referral, offers, security), plus a logout button that clears identity and query cache.",
  "frontend/src/pages/RechargePage.tsx": "Provides a mobile recharge UI where users enter a phone number, select an operator, choose a predefined plan, and submit a simulated recharge with toast feedback.",
  "frontend/src/pages/ReferralPage.tsx": "Displays the user's referral code (derived from their Internet Identity principal), allows copying or sharing it, and lists existing referrals fetched via the useReferrals hook.",
  "frontend/src/pages/SpendingLimitsPage.tsx": "Allows users to set monthly spending limits per category and displays progress bars comparing current month's debit totals against each configured limit.",
  "frontend/src/utils/analyticsCalculations.ts": "Provides helper functions to aggregate debit transactions by category and to compute total income vs. total expense from a transaction list.",
  "frontend/src/utils/analyticsInsights.ts": "Generates an array of insight cards (overspending alerts, subscription review, savings rate, month-over-month comparison) based on transactions and spending limits for a given period.",
  "frontend/src/utils/chatResponses.ts": "Returns canned financial advice responses for a simple rule-based chatbot, matching keywords like 'save', 'budget', 'expense', 'challenge', and 'limit'.",
  "frontend/src/utils/csvExport.ts": "Converts a list of transactions to a CSV file and triggers a browser download with a timestamped filename.",
  "frontend/src/utils/dateFilters.ts": "Provides utility functions to filter an array of Transactions by weekly (7-day), monthly (30-day), or yearly (365-day) time periods relative to the current date.",
  "frontend/src/utils/financialHealthScore.ts": "Calculates a composite financial health score (0–100) with a label and color based on savings rate, spending limit adherence, and challenge completion, weighted 40/40/20.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL query parameters from both standard and hash-based routes, persist them in sessionStorage, and remove sensitive parameters from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that enables dark mode via class, maps CSS variable-based design tokens to color/radius/font utilities, and registers the animate, typography, and container-queries plugins.",
  "project_state.json": "Tracks the overall FinMate project state (version 11), including architectural notes, known issues, image requirements, and a list of implemented features for this mobile budgeting and payment app."
}