{
  "backend/main.mo": "Main actor implementing a financial management system with user profiles, transactions, challenges, referrals, and spending limits. Includes authorization via MixinAuthorization, migration support, and functions for balance operations, bank account linking (setBankAccount/getBankAccount), transaction management, and leaderboard features.",
  "backend/migration.mo": "Migration module that converts OldUserProfile with bankAccountLinked:Bool to NewUserProfile with bankAccountNumber:?Text, setting all existing profiles' bankAccountNumber to null during upgrade.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features for bank account linking: BankLinkingPage component, useSetBankAccount hook, useGetBankAccount hook, /bank-linking route, and ProfilePage navigation button.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, hooks, and utilities for the FinMate financial management application with React, TanStack Router, and shadcn/ui components.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using oklch color space, defining colors for UI elements like primary, secondary, destructive, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point for the FinMate application with viewport meta tag and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup defining 10 routes (including /bank-linking), authentication guard via RootComponent, and ProfileSetupModal for first-time users.",
  "frontend/src/components/AnalyticsChatbot.tsx": "Analytics-focused chatbot component that provides spending insights by processing user messages through generateAnalyticsInsight utility with transaction data.",
  "frontend/src/components/BankBalanceCard.tsx": "PhonePe-style balance card with gradient purple background, show/hide toggle for balance visibility, and loading skeleton state.",
  "frontend/src/components/BottomNavigation.tsx": "Fixed bottom navigation bar with five tabs (Home, History, Analytics, Challenges, Profile) using purplish-blue active states and TanStack Router integration.",
  "frontend/src/components/CategorySpendingChart.tsx": "Renders a pie chart showing spending breakdown by category using Recharts, with custom OKLCH colors and percentage labels.",
  "frontend/src/components/ChatInterface.tsx": "Displays a chat interface with scrollable message history and an input form for sending messages to a bot.",
  "frontend/src/components/IncomeExpenseChart.tsx": "Renders a bar chart comparing total income vs expenses using Recharts with custom OKLCH colors.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header showing FinMate logo, content area with router outlet, and bottom navigation.",
  "frontend/src/components/PaymentForm.tsx": "Form for creating debit transactions with amount, category, description, and optional recipient fields; submits via useAddTransaction hook.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for initial user profile setup that collects the user's name and saves it via useSaveCallerUserProfile hook.",
  "frontend/src/components/QRScannerButton.tsx": "Floating action button that opens the QR scanner modal for making payments.",
  "frontend/src/components/QRScannerModal.tsx": "Modal with tabs for QR scanning or phone number payment methods, containing PaymentForm for transaction submission.",
  "frontend/src/components/TransactionList.tsx": "Displays a list of transactions with category icons, credit/debit indicators, amounts, timestamps, and descriptions.",
  "frontend/src/data/offers.ts": "Static data export containing student discount offers for various categories like food, travel, clothing, and recharge.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with Internet Identity authentication, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useAddTransaction.ts": "Mutation hook for adding transactions via the backend actor, invalidating transaction and balance queries on success.",
  "frontend/src/hooks/useBalance.ts": "Query hook that fetches the current user's balance from the backend actor.",
  "frontend/src/hooks/useChallenges.ts": "Query hook that fetches the list of available challenges from the backend actor.",
  "frontend/src/hooks/useCompleteChallenge.ts": "Mutation hook for completing challenges, showing success toast and invalidating challenges and profile queries.",
  "frontend/src/hooks/useGetBankAccount.ts": "Query hook that fetches the user's linked bank account number from the backend actor.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current user's profile from the backend actor, handling loading states for both actor and query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useLeaderboard.ts": "React Query hook that fetches leaderboard entries from the backend actor, returning an array of LeaderboardEntry objects.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating that query hooks are split into individual files rather than centralized.",
  "frontend/src/hooks/useReferrals.ts": "React Query hook that fetches the user's referrals as an array of Principal objects from the backend actor.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "Mutation hook for saving the current user's profile, invalidating the currentUserProfile query cache on success.",
  "frontend/src/hooks/useSetBankAccount.ts": "Mutation hook for setting a bank account number, invalidating both currentUserProfile and bankAccount query caches on success.",
  "frontend/src/hooks/useSetSpendingLimit.ts": "Mutation hook for setting spending limits by category, invalidating spendingLimits and currentUserProfile caches on success.",
  "frontend/src/hooks/useSpendingLimits.ts": "React Query hook that fetches spending limits as an array of SpendingLimit objects from the backend actor.",
  "frontend/src/hooks/useTransactions.ts": "React Query hook that fetches transactions with optional category filtering from the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, animation utilities, and accessibility preferences for reduced motion.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AnalyticsPage.tsx": "Analytics dashboard page with period filtering (weekly/monthly/yearly), displaying income vs expenses and category spending charts plus an AI chatbot for transaction insights.",
  "frontend/src/pages/BankLinkingPage.tsx": "Bank account linking page allowing users to link or update their bank account number with visual feedback for linked accounts.",
  "frontend/src/pages/ChallengesPage.tsx": "Challenges and rewards page displaying user's digi points, active challenges with progress tracking, and a leaderboard of top users.",
  "frontend/src/pages/ChatbotPage.tsx": "AI chatbot page providing personalized financial advice through a chat interface with simulated bot responses for budgeting and saving strategies.",
  "frontend/src/pages/HistoryPage.tsx": "Displays transaction history with weekly/monthly/yearly filtering tabs using TransactionList component and date filter utilities.",
  "frontend/src/pages/HomePage.tsx": "Main dashboard showing user welcome, bank balance, QR scanner button, quick action buttons (Recharge, Offers, AI Chat, Limits), and recent transactions list.",
  "frontend/src/pages/LoginPage.tsx": "Login page with Internet Identity authentication, featuring animated logo, login button with loading state, and feature highlights.",
  "frontend/src/pages/OffersPage.tsx": "Displays active student offers with discount badges, descriptions, expiry dates, and promo codes filtered by current date.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page showing balance, digi points, menu items for settings/referral/bank linking, and logout functionality.",
  "frontend/src/pages/ReferralPage.tsx": "Referral program page displaying user's referral code with copy/share functionality and list of referred users.",
  "frontend/src/pages/SpendingLimitsPage.tsx": "Spending limits management page with form to set category-based monthly budgets and progress tracking against current spending.",
  "frontend/src/utils/analyticsCalculations.ts": "Provides utility functions to calculate category-wise spending totals for debit transactions and compute total income vs expense from transaction lists.",
  "frontend/src/utils/analyticsInsights.ts": "Generates natural language insights based on user queries about spending, savings, budgets, and categories by analyzing transaction data.",
  "frontend/src/utils/chatResponses.ts": "Returns predefined chatbot responses for common student finance queries including greetings, saving tips, budgeting advice, expense management, challenges, and spending limits.",
  "frontend/src/utils/dateFilters.ts": "Filters transactions by time period (weekly, monthly, yearly) based on timestamp comparison with current date.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH, container settings, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a mobile student budgeting app with AI categorization, payment integration, gamification, dual chatbots, and analytics features using Internet Identity authentication."
}