{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace bank balance with ads, add PIN-verified balance check, and surface spending limits, challenges & leaderboard on Home page",
  "requirements": [
    {
      "id": "REQ-37",
      "summary": "Replace BankBalanceCard with promotional ads carousel on Home page",
      "acceptanceCriteria": [
        "BankBalanceCard is no longer visible on the Home page",
        "A carousel of at least 5 promotional ad cards is shown in its place",
        "Ad categories include Budgeting, Loans, and Investments at minimum",
        "Carousel auto-scrolls every 4 seconds",
        "Dot indicators reflect current card position",
        "Cards follow the purple-blue theme with gradient styling"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PromotionalAdsCarousel.tsx",
          "operation": "create",
          "description": "Create a horizontally scrollable promotional ads carousel component that displays ad cards for Budgeting Tips, Personal Loans, Mutual Fund Investments, Credit Score Improvement, and Student Savings Plans. Each card should show a title, short description, a generated image (from frontend/public/assets/generated/ad-*.dim_600x200.png), a CTA button, and use purple-blue gradient backgrounds matching the app theme. Implement auto-scroll functionality (every 4 seconds), manual swipe/click navigation, and dot indicators to show the current position. Use the generated images: frontend/public/assets/generated/ad-budgeting.dim_600x200.png, frontend/public/assets/generated/ad-loans.dim_600x200.png, frontend/public/assets/generated/ad-investments.dim_600x200.png, frontend/public/assets/generated/ad-credit-score.dim_600x200.png, and frontend/public/assets/generated/ad-student-savings.dim_600x200.png as the card backgrounds or inline images."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Remove the BankBalanceCard component import and usage. Replace it with the PromotionalAdsCarousel component, positioning it at the top of the main content area before the QR scanner button and quick actions. Ensure the carousel takes up appropriate horizontal space and maintains spacing consistency with other page elements."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Add PIN-verified balance check button and modal on Home page",
      "acceptanceCriteria": [
        "A 'Check Balance' button is visible on the Home page",
        "Tapping the button opens a 6-digit PIN input modal",
        "Correct PIN reveals the bank balance",
        "3 wrong attempts lock the modal for 30 seconds with an error message",
        "Balance is hidden again when the modal is dismissed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PinVerificationModal.tsx",
          "operation": "create",
          "description": "Create a modal component for PIN verification that displays a 6-digit masked input field. Implement client-side PIN validation by comparing the entered PIN hash with a stored PIN hash retrieved from localStorage. Track consecutive incorrect attempts (max 3) and lock the modal for 30 seconds after 3 failed attempts, displaying an error message. On successful PIN verification, emit a success event or callback to the parent component to reveal the balance. Include a close button that dismisses the modal and resets the attempt counter."
        },
        {
          "path": "frontend/src/hooks/usePinVerification.ts",
          "operation": "create",
          "description": "Create a custom hook that manages PIN verification state, including: storing and retrieving the PIN hash from localStorage, validating entered PIN by comparing hashes, tracking failed attempt count and lockout state with a 30-second timer, and resetting state after successful verification or modal dismissal. Expose functions to set the initial PIN (first-time setup), verify PIN, check lockout status, and reset attempts."
        },
        {
          "path": "frontend/src/components/BalanceRevealCard.tsx",
          "operation": "create",
          "description": "Create a compact card component that displays the user's bank balance (fetched via useBalance hook) in a gradient-styled overlay or inline section. The card should only render when balance is successfully retrieved and should include a dismiss/hide button. Use the existing purple-blue theme with gradient styling to match the app aesthetic."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add a 'Check Balance' button below the PromotionalAdsCarousel. Wire the button to open the PinVerificationModal component. On successful PIN verification, display the BalanceRevealCard showing the user's balance. Handle modal dismissal by hiding the balance card and resetting PIN verification state. Import and use the usePinVerification hook to manage PIN state and the useBalance hook to fetch balance data."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Add Spending Limits summary section on Home page",
      "acceptanceCriteria": [
        "Spending limits section appears on the Home page below the ads carousel",
        "Up to 4 categories with limits are displayed as compact progress rows",
        "Progress bar reflects current month's spend vs. limit",
        "Amber indicator shown when spend >= 80% of limit",
        "Red indicator shown when spend > 100% of limit",
        "'View All' link navigates to SpendingLimitsPage"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SpendingLimitsSummary.tsx",
          "operation": "create",
          "description": "Create a component that fetches spending limits via useSpendingLimits and current month's debit transactions via useTransactions (filtered by 30-day period). For each category with a limit, calculate the current month's spend by summing debit transactions in that category. Display up to 4 categories as compact rows, each showing: category name, a progress bar (current spend / limit), and the amount spent vs. the limit (e.g., '₹5,000 / ₹10,000'). Apply an amber warning indicator (border or icon) when spend >= 80% of limit, and a red over-budget indicator when spend > 100% of limit. Include a 'View All' link at the bottom that navigates to /spending-limits using TanStack Router's Link component."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add the SpendingLimitsSummary component below the PromotionalAdsCarousel and PIN-verified balance section. Ensure proper spacing and section separation using the existing layout utilities."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Add Challenges & Leaderboard preview section on Home page",
      "acceptanceCriteria": [
        "Challenges & Leaderboard section is visible on the Home page",
        "Up to 2 active challenges are shown with progress and a Complete button",
        "Completing a challenge triggers the useCompleteChallenge mutation and shows a success toast",
        "Top 3 leaderboard entries are displayed with rank, name, and digi points",
        "'View All' links navigate to ChallengesPage"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ChallengesLeaderboardPreview.tsx",
          "operation": "create",
          "description": "Create a component that fetches challenges via useChallenges and leaderboard via useLeaderboard. Display up to 2 active (incomplete) challenges as compact cards showing: challenge title, a progress indicator (if applicable), and a 'Complete' button. Wire the Complete button to call the useCompleteChallenge mutation with the challenge ID; on success, the mutation already invalidates queries and shows a toast. Below the challenges, render a mini leaderboard table showing the top 3 users with columns for rank (1, 2, 3), name (or truncated principal if name unavailable), and digi points. Include a 'View All' link at the bottom that navigates to /challenges using TanStack Router's Link component."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add the ChallengesLeaderboardPreview component below the SpendingLimitsSummary section. Ensure proper spacing and that all new sections fit within the scrollable content area of the home page without overlapping the bottom navigation."
        }
      ]
    }
  ]
}